;************************************************************************************
datasg segment
       mus_freq   dw 262,294,330,262,262,294,330,262      ;频率决定音高
                  dw 330,349,392,330,349,392,392,440
                  dw 392,349,330,262,392,440,392,349
                  dw 330,262,294,196,262,294,196,262

       mus_time   dw 2500,2500,2500,2500,2500,2500,2500,2500,2500,2500    ;节拍决定音长
                  dw 5000,2500,2500,5000,1200,1200,1200,1200,2500,2500
                  dw 1200,1200,1200,1200,2500,2500,2500,2500,5000,2500,2500,5000

    mes    db 31h,32h,33h,31h,31h,32h,33h,31h,33h,34h,35h,33h,34h,35h,35h,36h
      db 35h,34h,33h,31h,35h,36h,35h,34h,33h,31h,32h,35h,31h,32h,35h,31h,'$'
    
datasg ends
;************************************************************************************
;************************************************************************************
codesg segment
    main    proc   far
         assume cs:codesg,ds:datasg
   org    100h     ;链接器将之后的程序放在0100h的开始位置
;-----------------------------------------------------
 start:
         push ds
   sub  ax,ax
   push ax
   mov  ax,datasg
   mov  ds,ax
; 
            lea  di,mus_freq   ;频率
            lea  bx,mus_time   ;节拍
   lea  si,mes    ;音符
            mov  cx,32d;
;-----------------------------------------------------
 new_shot:  
            push cx
      call sound
   add  di,2
      add  bx,2
   add  si,1
   mov  cx,0ffffh
;-----------------------------------------------------
 silent:
   loop silent
         pop  cx
   loop new_shot
   mov  al,48h
         out  61h,al
           
   mov  ah,4ch
   int  21h
   
      ret
 main endp
 
;-----------------------------------------------------
sound proc near

   mov  ah,02h    ;利用中断21h的02功能调用，显示音符简谱
   and  si,00ffh
   mov  dx,[si]
   int  21h

   in  al,61h
   and  al,11111100b
  sing:
      xor  al,2    ;将PB1置1，打开扬声器
   out  61h,al

   push ax
   call widnth
   pop  ax
   mov  cx,dx
  waits:
      loop waits    ;循环延迟，由此控制开关电路所产生脉冲的频率
      dec  WORD PTR [bx]  ;实现相应节拍的声音
   jnz  sing

   
      and  al,11111100b  ;关闭扬声器
   out  61h,al
   ret       ;一轮实现了一个音的输出
  
sound endp
;----------------------------------------------------- 
;-----------------------------------------------------
widnth proc near     ;控制脉宽的计数值
            mov  ax,2801    
   push bx     ;保存的是节拍
   mov  bx,50
            mul  bx
   div  WORD PTR [di]  ;除以了相应的频率
   mov  dx,ax
   pop  bx
   ret
widnth endp
;-----------------------------------------------------
codesg ends  
;************************************************************************************   
 end start
;************************************************************************************
